<a href="https://colab.research.google.com/github/r-ap/TrainingMachineLearning/blob/main/BFI_PYIM_6_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Data Cleaning

**Data Real Estate**

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('https://raw.githubusercontent.com/fahmimnalfrzki/Dataset/main/data.csv.xls')

In [3]:
data

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
506,0.98765,0.0,12.50,0,0.561,6.980,89.0,2.0980,3,320,23.0,396.00,12.00,12.0
507,0.23456,0.0,12.50,0,0.561,6.980,76.0,2.6540,3,320,23.0,343.00,25.00,32.0
508,0.44433,0.0,12.50,0,0.561,6.123,98.0,2.9870,3,320,23.0,343.00,21.00,54.0
509,0.77763,0.0,12.70,0,0.561,6.222,34.0,2.5430,3,329,23.0,343.00,76.00,67.0
510,0.65432,0.0,12.80,0,0.561,6.760,67.0,2.9870,3,345,23.0,321.00,45.00,24.0

## Melihat rangkuman informasi mengenai struktur data

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 511 entries, 0 to 510
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     511 non-null    float64
 1   ZN       511 non-null    float64
 2   INDUS    511 non-null    float64
 3   CHAS     511 non-null    int64
 4   NOX      511 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      511 non-null    float64
 7   DIS      511 non-null    float64
 8   RAD      511 non-null    int64
 9   TAX      511 non-null    int64
 10  PTRATIO  511 non-null    float64
 11  B        511 non-null    float64
 12  LSTAT    511 non-null    float64
 13  MEDV     511 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 56.0 KB

Ada missing value di kolom `RM`.

In [5]:
data.describe()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
count,511.000000,511.000000,511.000000,511.000000,511.000000,506.000000,511.000000,511.000000,511.000000,511.000000,511.000000,511.000000,511.000000,511.000000
mean,3.584139,11.252446,11.151096,0.068493,0.554757,6.287589,68.616243,3.783876,9.485323,407.440313,18.500000,356.600900,12.879550,22.682192
std,8.564433,23.234838,6.828175,0.252838,0.115310,0.703802,28.099130,2.098631,8.688469,167.903532,2.200348,90.882679,7.797416,9.484262
min,0.006320,0.000000,0.460000,0.000000,0.385000,3.561000,2.900000,1.129600,1.000000,187.000000,12.600000,0.320000,1.730000,5.000000
25%,0.082325,0.000000,5.190000,0.000000,0.449000,5.885500,45.050000,2.100350,4.000000,279.500000,17.400000,374.710000,7.065000,17.050000
50%,0.261690,0.000000,9.690000,0.000000,0.538000,6.209000,77.300000,3.152300,5.000000,330.000000,19.100000,391.340000,11.450000,21.200000
75%,3.621175,12.500000,18.100000,0.000000,0.624000,6.629750,94.050000,5.118000,24.000000,666.000000,20.200000,396.210000,17.105000,25.000000
max,88.976200,100.000000,27.740000,1.000000,0.871000,8.780000,100.000000,12.126500,24.000000,711.000000,23.000000,396.900000,76.000000,67.000000

## Cek dan Mengatasi Missing Values

In [6]:
data['RM'].isna().sum()

5

In [7]:
data[data['RM'].isna()]

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
10,0.22489,12.5,7.87,0,0.524,NaN,94.3,6.3467,5,311,15.2,392.52,20.45,15.0
35,0.06417,0.0,5.96,0,0.499,NaN,68.2,3.3603,5,279,19.2,396.90,9.68,18.9
63,0.12650,25.0,5.13,0,0.453,NaN,43.4,7.9809,8,284,19.7,395.58,9.50,25.0
96,0.11504,0.0,2.89,0,0.445,NaN,69.6,3.4952,2,276,18.0,391.83,11.34,21.4
135,0.55778,0.0,21.89,0,0.624,NaN,98.2,2.1107,4,437,21.2,394.67,16.96,18.1

### Cara 1: Menghapus baris yang terdapat missing values

In [8]:
data_copy1 = data.copy()
data_copy1 = data.dropna()

In [9]:
data_copy1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 506 entries, 0 to 510
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     506 non-null    float64
 1   ZN       506 non-null    float64
 2   INDUS    506 non-null    float64
 3   CHAS     506 non-null    int64
 4   NOX      506 non-null    float64
 5   RM       506 non-null    float64
 6   AGE      506 non-null    float64
 7   DIS      506 non-null    float64
 8   RAD      506 non-null    int64
 9   TAX      506 non-null    int64
 10  PTRATIO  506 non-null    float64
 11  B        506 non-null    float64
 12  LSTAT    506 non-null    float64
 13  MEDV     506 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 59.3 KB

In [10]:
data_copy1['RM'].isna().sum()

0

### Cara 2 : Mengisi sel kosong dengan suatu nilai

In [12]:
data_copy2 = data.copy()

In [13]:
avg = data_copy2.RM.mean()
median = data_copy2.RM.median()
modus = data_copy2.RM.mode()

print('Rata-rata RM:',avg)
print('Nilai tengah RM:',median)
print('Modus RM:',modus)

Rata-rata RM: 6.287588932806333
Nilai tengah RM: 6.209
Modus RM: 0    6.98
dtype: float64

In [14]:
data_copy2.fillna(avg,inplace=True)

In [15]:
data_copy2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 511 entries, 0 to 510
Data columns (total 14 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   CRIM     511 non-null    float64
 1   ZN       511 non-null    float64
 2   INDUS    511 non-null    float64
 3   CHAS     511 non-null    int64
 4   NOX      511 non-null    float64
 5   RM       511 non-null    float64
 6   AGE      511 non-null    float64
 7   DIS      511 non-null    float64
 8   RAD      511 non-null    int64
 9   TAX      511 non-null    int64
 10  PTRATIO  511 non-null    float64
 11  B        511 non-null    float64
 12  LSTAT    511 non-null    float64
 13  MEDV     511 non-null    float64
dtypes: float64(11), int64(3)
memory usage: 56.0 KB

### Cek data duplikat

`dataframe.duplicated(keep='last' atau 'first')`

In [16]:
data_copy2.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
506    False
507    False
508    False
509    False
510    False
Length: 511, dtype: bool

In [17]:
data_copy2[data_copy2.duplicated()]

Empty DataFrame
Columns: [CRIM, ZN, INDUS, CHAS, NOX, RM, AGE, DIS, RAD, TAX, PTRATIO, B, LSTAT, MEDV]
Index: []

**Cek Data Duplikat (Tambahan)**

In [18]:
df = pd.DataFrame({
     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
     'rating': [4, 4, 3.5, 15, 5]})
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [23]:
df.duplicated()
df[df.duplicated()]

#hapus yang awal
df.duplicated(keep='last')

#menghilangkan duplikat
df[~df.duplicated()]

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [29]:
#hapus duplicate hanya colum tertentu

df.duplicated(subset=['brand','style'], keep='first')

df[~df.duplicated(subset=['brand','style'], keep='first')]

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0

## Manipulasi Time ##

In [40]:
house_price = pd.read_csv('https://raw.githubusercontent.com/fahmimnalfrzki/Dataset/main/kc_house_data.csv')

house_price.head()

house_price['date']

pd.to_datetime(house_price['date'])

house_price['date'].astype('datetime64[ns]')

0       2014-10-13
1       2014-12-09
2       2015-02-25
3       2014-12-09
4       2015-02-18
           ...
21608   2014-05-21
21609   2015-02-23
21610   2014-06-23
21611   2015-01-16
21612   2014-10-15
Name: date, Length: 21613, dtype: datetime64[ns]

In [41]:
from datetime import datetime
import numpy as np

date_rng = pd.date_range(start='1/01/2020', end='12/08/2022', freq='H')

df_time = pd.DataFrame(date_rng, columns=['date'])

df_time['data'] = np.random.randint(0,100,size=(len(date_rng)))

df_time

                     date  data
0     2020-01-01 00:00:00    91
1     2020-01-01 01:00:00    90
2     2020-01-01 02:00:00    20
3     2020-01-01 03:00:00    25
4     2020-01-01 04:00:00    91
...                   ...   ...
25724 2022-12-07 20:00:00    36
25725 2022-12-07 21:00:00    54
25726 2022-12-07 22:00:00    22
25727 2022-12-07 23:00:00    23
25728 2022-12-08 00:00:00     2

[25729 rows x 2 columns]

In [46]:
df_time['date'].dt.year

df_time['date'].dt.month

df_time['date'].dt.day

df_time['date'].dt.time

df_time['date'].dt.hour

df_time['date'].dt.minute

df_time['date'].dt.second

df_time['date'].dt.day_of_week # 0:Minggu - 6: Sabtu

0        2
1        2
2        2
3        2
4        2
        ..
25724    2
25725    2
25726    2
25727    2
25728    3
Name: date, Length: 25729, dtype: int64

In [47]:
df_time_idx = df_time.set_index('date')
df_time_idx.head()

                     data
date
2020-01-01 00:00:00    91
2020-01-01 01:00:00    90
2020-01-01 02:00:00    20
2020-01-01 03:00:00    25
2020-01-01 04:00:00    91

In [62]:
df_time_idx['2020-01-01']

df_time_idx.loc['2020-01-01 10']

C:\Users\010497\AppData\Local\Temp/ipykernel_35240/826075967.py:1: FutureWarning: Indexing a DataFrame with a datetimelike index using a single string to slice the rows, like `frame[string]`, is deprecated and will be removed in a future version. Use `frame.loc[string]` instead.
  df_time_idx['2020-01-01']

data    82
Name: 2020-01-01 10:00:00, dtype: int32

# Final Project

### Regresi

1. Memprediksi biaya tagihan rumah sakit. Data: https://www.kaggle.com/datasets/mirichoi0218/insurance
2. Memprediksi harga rumah. Data: https://www.kaggle.com/datasets/harlfoxem/housesalesprediction
3. Memprediksi kualitas White Wine. Data: https://www.kaggle.com/datasets/piyushagni5/white-wine-quality
4. Memprediksi harga mobil bekas. Data: https://www.kaggle.com/datasets/mayankpatel14/second-hand-used-cars-data-set-linear-regression
5. Memprediksi tingkat emisi CO2 di USA (Forecasting)**. Data: https://www.kaggle.com/datasets/soheiltehranipour/co2-dataset-in-usa
6. Memprediksi harga mobil. Data: https://www.kaggle.com/datasets/nehalbirla/vehicle-dataset-from-cardekho?select=Car+details+v3.csv
7. Memprediksi kekuatan konkrit semen. Data: https://www.kaggle.com/datasets/prathamtripathi/regression-with-neural-networking
8. Memprediksi tarif Uber Taxi. Data: https://www.kaggle.com/datasets/yasserh/uber-fares-dataset


### Klasifikasi

1. Mengklasifikasi skor credit seorang nasabah. Data: https://www.kaggle.com/datasets/parisrohan/credit-score-classification
2. Mengklasifikasi keterimaan kartu kredit. Data: https://www.kaggle.com/datasets/vikasukani/loan-eligible-dataset
3. Mengklasifikasi seseorang menderita diabetes atau tidak. Data: https://www.kaggle.com/datasets/kandij/diabetes-dataset
4. Memprediksi delay pesawat. Data: https://www.kaggle.com/datasets/jimschacko/airlines-dataset-to-predict-a-delay
5. Memprediksi pengiriman barang on-time atau tidak. Data: https://www.kaggle.com/datasets/prachi13/customer-analytics
6. Deteksi Fraud**. Data: https://www.kaggle.com/datasets/ban7002/fraud-challenge-data
7. Memprediksi status pinjaman. Data: https://www.kaggle.com/datasets/anmolkumar/analytics-vidhya-loan-prediction?select=train.csv
8. Churn Modelling (Memprediksi loyalitas pelanggan). https://www.kaggle.com/datasets/shrutimechlearn/churn-modelling
9. Memprediksi keterimaan tawaran produk deposito. Data: https://www.kaggle.com/datasets/sharanmk/bank-marketing-term-deposit
10. Memprediksi kemangkiran bayar tagihan kredit. Data: https://www.kaggle.com/datasets/ankitkalauni/bank-loan-defaulter-prediction-hackathon?select=train.csv



### Clustering

1. Segmentasi konsumen. Data: https://www.kaggle.com/datasets/seetzz/market-segmentation
2. Mengelompokkan Negara. Data: https://www.kaggle.com/datasets/mmattson/who-national-life-expectancy
3. Mengelompokkan Wine. Data: https://www.kaggle.com/datasets/harrywang/wine-dataset-for-clustering
4. Mengelompokkan Transaksi Bank. Data: https://www.kaggle.com/datasets/apoorvwatsky/bank-transaction-data